using System;

namespace ReceivingStation.Decode
{
    static class Constants
    {
        public static int WDT = 1568; // Ширина рисунка.
        public static int HGT = 8; // Высота рисунка.

        public static DateTime referenceDate = new DateTime(2001, 1, 1, 0, 0, 0);

        public static int DL_JPEG = 1500; // Длина буфера jpeg с запасом - полос + на шапку.
        public static int DL_VIDEO = 896; // Длина видеобуфера.

        public static int DL_IN_BUF = 4096; // Длина входного буфера, должно делиться на 2048.

        public static int DL_INTRL_BUF = 2654208; // Длина буфера интерл. в битах 2048*36*36.

        public static int DL_IN_VIT_BUF = 16384; // Длина входного буф.для Витерби 2048 байт.
        public static int DL_VIT_BUF = 1024; // Длина буфера после Витарби, должно делиться на 1024.

        public static byte[] zag_tk_bit = { 
            0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1,
            1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1,
            1, 1, 0, 1 };  // транспортный заголовок в битах

        //Константы по транспортному кадру
        public static int NOM_VER = 1; //2 бита - номер версии структуры пакета по CCSDS
        public static int IDENT_KA = 0; //8 бит - идент. КА     
        public static int KADR_INFO = 5; //6 бит - идент. информац. кадра
        public static int KADR_LOOSE = 63; //6 бит - идент. холостого кадра

        //Константы по парц. пакетам
        public static int APID_1 = 64;	//АПИД 1-го канала
        public static int APID_6 = 69;	//АПИД 6-го канала
        public static int APID_c = 70;	//АПИД служебного пакета
        public static int DELTA_T = 1;   //временная разница между полосами
        public static int MAX_MSU = 182;	//макс. номер МСУ
        public static int MAX_Q = 100; //макс. коэф. качества

        public static int slugLength = 112; //Байт на служебную информацию.

        public static byte[] psp = { 2, 24, 167, 163, 146, 221, 154, 191 }; //ПСП - начало кадра БРЛК

        public static int KOL_OUT_BUF = WDT * 16 + slugLength;   // Длина выходного буфера.   
   
        public static int PMEM = 128;

        // Массив для проверки принятых данных в режиме "Самопроверка".
        public static byte[] tkTemplateForSelfTest = {
            0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
            11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
            21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
            31, 32, 33, 34, 35, 36, 37, 38, 39, 40,
            41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
            51, 52, 53, 54, 55, 56, 57, 58, 59, 60,
            61, 62, 63, 64, 65, 66, 67, 68, 69, 70,
            71, 72, 73, 74, 75, 76, 77, 78, 79, 80,
            81, 82, 83, 84, 85, 86, 87, 88, 89, 90,
            91, 92, 93, 94, 95, 96, 97, 98, 99, 100,
            101, 102, 103, 104, 105, 106, 107, 108, 109, 110,
            111, 112, 113, 114, 115, 116, 117, 118, 119, 120,
            121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
            131, 132, 133, 134, 135, 136, 137, 138, 139, 140,
            141, 142, 143, 144, 145, 146, 147, 148, 149, 150,
            151, 152, 153, 154, 155, 156, 157, 158, 159, 160,
            161, 162, 163, 164, 165, 166, 167, 168, 169, 170,
            171, 172, 173, 174, 175, 176, 177, 178, 179, 180,
            181, 182, 183, 184, 185, 186, 187, 188, 189, 190,
            191, 192, 193, 194, 195, 196, 197, 198, 199, 200,
            201, 202, 203, 204, 205, 206, 207, 208, 209, 210,
            211, 212, 213, 214, 215, 216, 217, 218, 219, 220,
            221, 222, 223, 224, 225, 226, 227, 228, 229, 230,
            231, 232, 233, 234, 235, 236, 237, 238, 239, 240,
            241, 242, 243, 244, 245, 246, 247, 248, 249, 250,
            251, 252, 253, 254
        };
    }
}
